In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import csv
data = [ ["name" , "email_id" , "phone" ],
         ["suraj", "suraj@gmial.com", 984561285],
         ["krish", "krish@gmial.com" , 879456123],
         ["Ravi" , "ravi#gmial.com" , 78456123085],
         ["sunil" , "sunil@gmail.com", 79845612956],
         ["furw" , "fdjm#gmaiacom" , 7984561235],
         ["hgb" , "etgfdetgfs@gmai.com" ,9846512562]
            
]

In [4]:
with open("service.csv", "w" ) as f :
    writer = csv.writer(f)
    
    for i in data:
        writer.writerow(i)

In [5]:
df = pd.read_csv("service.csv")

In [6]:
df.head()

    name         email_id        phone
0  suraj  suraj@gmial.com    984561285
1  krish  krish@gmial.com    879456123
2   Ravi   ravi#gmial.com  78456123085
3  sunil  sunil@gmail.com  79845612956
4   furw    fdjm#gmaiacom   7984561235

In [7]:
df.head(3)

    name         email_id        phone
0  suraj  suraj@gmial.com    984561285
1  krish  krish@gmial.com    879456123
2   Ravi   ravi#gmial.com  78456123085

In [8]:
df.tail(3)

    name             email_id        phone
3  sunil      sunil@gmail.com  79845612956
4   furw        fdjm#gmaiacom   7984561235
5    hgb  etgfdetgfs@gmai.com   9846512562

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
list(df.columns)

['name', 'email_id', 'phone']

In [11]:
df['email_id']

0        suraj@gmial.com
1        krish@gmial.com
2         ravi#gmial.com
3        sunil@gmail.com
4          fdjm#gmaiacom
5    etgfdetgfs@gmai.com
Name: email_id, dtype: object

In [12]:
df['name']

0    suraj
1    krish
2     Ravi
3    sunil
4     furw
5      hgb
Name: name, dtype: object

In [13]:
type(df['name'])

pandas.core.series.Series

In [14]:
list(df['name'])

['suraj', 'krish', 'Ravi', 'sunil', 'furw', 'hgb']

In [15]:
type(list(df['name']))

list

In [16]:
df[['name']]

    name
0  suraj
1  krish
2   Ravi
3  sunil
4   furw
5    hgb

In [17]:
type(df[['name']])

pandas.core.frame.DataFrame

In [18]:
df.columns

Index(['name', 'email_id', 'phone'], dtype='object')

In [19]:
df[['email_id','name']]

              email_id   name
0      suraj@gmial.com  suraj
1      krish@gmial.com  krish
2       ravi#gmial.com   Ravi
3      sunil@gmail.com  sunil
4        fdjm#gmaiacom   furw
5  etgfdetgfs@gmai.com    hgb

In [20]:
df.dtypes

name        object
email_id    object
phone        int64
dtype: object

In [21]:
pd.read_excel("LUSID Excel - Setting up your market data")

FileNotFoundError: [Errno 2] No such file or directory: 'LUSID Excel - Setting up your market data'

In [22]:
df2 = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [23]:
df2.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [24]:
type(df2)

pandas.core.frame.DataFrame

In [25]:
df2['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [26]:
type(df2['Survived'])

pandas.core.series.Series

In [27]:
df2[['Survived', 'Pclass', ]]

     Survived  Pclass
0           0       3
1           1       1
2           1       3
3           1       1
4           0       3
..        ...     ...
886         0       2
887         1       1
888         0       3
889         1       1
890         0       3

[891 rows x 2 columns]

In [30]:
url_data = pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [29]:
pip install lxml

Requirement already satisfied: lxml in /opt/conda/lib/python3.10/site-packages (4.9.2)
Note: you may need to restart the kernel to use updated packages.

In [31]:
type(url_data)

list

In [32]:
len(url_data)

1

In [33]:
df3 = url_data[0]

In [34]:
df3

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [36]:
df3.head(5)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [38]:
df3.tail(3)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [39]:
df3.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [43]:
df3[['Rk', 'Player', 'Pos']]

      Rk          Player Pos
0      1      Quincy Acy  PF
1      2    Jordan Adams  SG
2      3    Steven Adams   C
3      4     Jeff Adrien  PF
4      5   Arron Afflalo  SG
..   ...             ...  ..
670  490  Thaddeus Young  PF
671  490  Thaddeus Young  PF
672  490  Thaddeus Young  PF
673  491     Cody Zeller   C
674  492    Tyler Zeller   C

[675 rows x 3 columns]

In [47]:
df3.to_csv("players_data.csv",index = False)
#this code will help you to store html data into your lab as csv or msxcel

In [48]:
import pandas as pd

data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],

        'Age': [25, 30, 35, 40],

        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']}

df = pd.DataFrame(data)

print(df.loc[0])

Name              John
Age                 25
Occupation    Engineer
Name: 0, dtype: object